yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/timer_reg.h
     * |        |          |1 = Write 1 to cClear 16-bit PWM counter to 0x0000 in up count type.
     * |        |          |Note: When user writes this bit to 1, PWM counter will be cleared after (CLKPSC+16) TMRx_CLK cycles.

     * @var TIMER_T::PWMPERIOD
     * Offset: 0x4C  Timer PWM Period Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |PERIOD    |PWM Period Register
     * |        |          |In up count type: PWM counter counts from 0 to PERIOD, and restarts from 0.
     * |        |          |In up count type:
     * |        |          |PWM period time = (PERIOD + 1) * (CLKPSC + 1) * TMRx_PWMCLK.
     * @var TIMER_T::PWMCMPDAT
     * Offset: 0x50  Timer PWM Comparator Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |CMP       |PWM Comparator Register
     * |        |          |PWM CMP is used to compare with PWM CNT to generate PWM output waveform, interrupt events and trigger ADC PDMA start conversion.
     * @var TIMER_T::PWMCNT
     * Offset: 0x54  Timer PWM Counter Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |CNT       |PWM Counter Value Register (Read Only)
     * |        |          |User can monitor CNT to know the current counter value in 16-bit period counter.
     * @var TIMER_T::PWMPOLCTL
     * Offset: 0x58  Timer PWM Pin Output Polar Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PINV      |PWMx Output Pin Polar Control Bit
     * |        |          |The bit is used to control polarity state of PWMx_OUT pin.
     * |        |          |0 = PWMx_OUT pin polar inverse Disabled.
     * |        |          |1 = PWMx_OUT polar inverse Enabled.
     * |        |          |Note: Set POSEL (TIMERx_PWMPOCTL[8]) to select TMx or TMx_EXT as PWMx output pin.
     * @var TIMER_T::PWMPOCTL
     * Offset: 0x5C  Timer PWM Pin Output Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |POEN      |PWMx Output Pin Enable Bit
     * |        |          |0 = PWMx_OUT pin at tri-state mode.
     * |        |          |1 = PWMx_OUT pin in output mode.
     * |        |          |Note: Set POSEL (TIMERx_PWMPOCTL[8]) to select TMx or TMx_EXT as PWMx output pin.
     * |[8]     |POSEL     |PWM Output Pin Select
     * |        |          |0 = PWMx_OUT pin is TMx.
     * |        |          |1 = PWMx_OUT pin is TMx_EXT.
     * @var TIMER_T::PWMINTEN0
     * Offset: 0x60  Timer PWM Interrupt Enable Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1]     |PIEN      |PWM Period Point Interrupt Enable Bit
     * |        |          |0 = Period point interrupt Disabled.
     * |        |          |1 = Period point interrupt Enabled.
     * |[2]     |CMPUIEN   |PWM Compare Up Count Interrupt Enable Bit
     * |        |          |0 = Compare up count interrupt Disabled.
     * |        |          |1 = Compare up count interrupt Enabled.
     * @var TIMER_T::PWMINTSTS0
     * Offset: 0x64  Timer PWM Interrupt Status Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1]     |PIF       |PWM Period Point Interrupt Flag
     * |        |          |This bit is set by hardware when TIMERx_PWM counter reaches PERIOD.
     * |        |          |Note: This bit is cleared by writing 1 to it.
     * |[2]     |CMPUIF    |PWM Compare Up Count Interrupt Flag
     * |        |          |This bit is set by hardware when TIMERx_PWM counter in up count direction and reaches CMP.
     * |        |          |Note: If CMP equal to PERIOD, there is no CMPUIF flag in up count type
     * |        |          |Note 2: This bit is cleared by writing 1 to it.
     * @var TIMER_T::PWMTRGCTL
     * Offset: 0x68  Timer PWM Trigger Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |TRGSEL    |PWM Counter Event Source Select to Trigger Conversion
     * |        |          |00 = Trigger conversion at period point (PIF).
     * |        |          |01 = Trigger conversion at compare up count point (CMPUIF).
     * |        |          |10 = Trigger conversion at period or compare up count point (PIF or CMPUIF).
     * |        |          |11 = Reserved.
     * |[7]     |PWMTRGADC|PWM Counter Event Trigger ADC Conversion Enable Bit
     * |        |          |0 = PWM counter event trigger ADC conversion Disabled.
     * |        |          |1 = PWM counter event trigger ADC conversion Enabled.
     * |        |          |Note: Set TRGSEL (TIMERx_PWMTRGCTL[1:0]) to select PWM trigger conversion source.
     * |[9]     |PWMTRGPDMA|PWM Counter Event Trigger PDMA Conversion Enable Bit
     * |        |          |If this bit is set to 1, PWM can trigger PDMA conversion.
     * |        |          |0 = PWM trigger PDMA Disabled.
     * |        |          |1 = PWM trigger PDMA Enabled.
     * |        |          |Note: Set TRGSEL (TIMERx_PWMTRGCTL[1:0]) to select PWM trigger conversion source.
     * @var TIMER_T::PWMSTATUS
     * Offset: 0x6C  Timer PWM Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |CNTMAXF   |PWM Counter Equal to 0xFFFF Flag
     * |        |          |0 = The PWM counter value never reached its maximum value 0xFFFF.
     * |        |          |1 = The PWM counter value has reached its maximum value.
     * |        |          |Note: This bit is cleared by writing 1 to it..
     * |[16]    |ADCTRGF   |Trigger ADC Start Conversion Flag
     * |        |          |0 = PWM counter event trigger ADC start conversion is not occurred.
     * |        |          |1 = PWM counter event trigger ADC start conversion has occurred.
     * |        |          |Note: This bit is cleared by writing 1 to it.
     * |[18]    |PDMATRGF  |Trigger PDMA Start Conversion Flag
     * |        |          |0 = PWM counter event trigger PDMA start conversion has not occurred.
     * |        |          |1 = PWM counter event trigger PDMA start conversion has occurred.
     * |        |          |Note: This bit is cleared by writing 1 to it.
     * @var TIMER_T::PWMPBUF
     * Offset: 0x70  Timer PWM Period Buffer Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |PBUF      |PWM Period Buffer Register (Read Only)
     * |        |          |Used as PERIOD active register.
     * @var TIMER_T::PWMCMPBUF
     * Offset: 0x74  Timer PWM Comparator Buffer Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |CMPBUF    |PWM Comparator Buffer Register (Read Only)
     * |        |          |Used as CMP active register.
     * @var TIMER_T::PWMIFA
     * Offset: 0xA8  Timer PWM Interrupt Flag Accumulator Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |IFACNT    |PWM Interrupt Flag Accumulator Counter
     * |        |          |This field sets the count number which defines (IFACNT+1) times of specify PWM interrupt occurs to set IFAIF bit to request the PWM accumulator interrupt.
     * |        |          |PWM accumulator flag (IFAIF) will be set in every (IFACNT+1) times during the the PWM counter operation.
     * |[24]    |STPMOD    |PWM Accumulator Stop Mode Enable Bit
     * |        |          |0 = PWM interrupt accumulator event to stop counting Disabled.
     * |        |          |1 = PWM interrupt accumulator event to stop counting Enabled.
     * |[29:28] |IFASEL    |PWM Interrupt Flag Accumulator Source Select
     * |        |          |01 = Accumulate at each PWM period point.
     * |        |          |10 = Accumulate at each PWM up-count compared point.
     * |[31]    |IFAEN     |PWM Interrupt Flag Accumulator Enable Bit
     * |        |          |0 = PWM interrupt flag accumulator function Disabled.
     * |        |          |1 = PWM interrupt flag accumulator function Enabled.
     * @var TIMER_T::PWMAINTSTS
     * Offset: 0xAC  Timer PWM Accumulator Interrupt Flag Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |IFAIF     |PWM Interrupt Flag Accumulator Interrupt Flag
     * |        |          |This bit is set by hardware when the accumulator value reaches (IFACNT+1)
     * |        |          |Note 1: This bit is cleared by writing 1 to it.
     * |        |          |Note 2: If APDMAEN (TIMERx_PWMAPDMACTL[0]) is set, this bit will be auto clear after PDMA transfer done.
     * @var TIMER_T::PWMAINTEN
     * Offset: 0xB0  Timer PWM Accumulator Interrupt Enable Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |IFAIEN    |PWM Interrupt Flag Accumulator Interrupt Enable Bit
     * |        |          |0 = Interrupt Flag Accumulator interrupt Disabled.
     * |        |          |1 = Interrupt Flag Accumulator interrupt Enabled.
     * @var TIMER_T::PWMAPDMACTL
     * Offset: 0xB4  Timer PWM Accumulator PDMA Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |APDMAEN   |PWM Accumulator PDMA Enable Bit
     * |        |          |0 = PWM interrupt accumulator event to trigger PDMA transfer Disabled.
     * |        |          |1 = PWM interrupt accumulator event to trigger PDMA transfer Enabled.
     */
    __IO uint32_t CTL;     /*!< [0x00] Timer Control Register */
    __IO uint32_t CMP;     /*!< [0x04] Timer Comparator Register */
    __IO uint32_t INTSTS;  /*!< [0x08] Timer Interrupt Status Register */
    __IO uint32_t CNT;     /*!< [0x0C] Timer Data Register */
    __I uint32_t CAP;      /*!< [0x10] Timer Capture Data Register */
    __IO uint32_t EXTCTL;  /*!< [0x14] Timer External Control Register */
    __IO uint32_t EINTSTS; /*!< [0x18] Timer External Interrupt Status Register */
    __IO uint32_t TRGCTL;  /*!< [0x1C] Timer Trigger Control Register */
    __I uint32_t RESERVE0[1];
    __IO uint32_t CAPNF; /*!< [0x24] Timer Capture Input Noise Filter Register */
    __I uint32_t RESERVE1[6];
    __IO uint32_t PWMCTL;     /*!< [0x40] Timer PWM Control Register */
    __IO uint32_t PWMCLKPSC;  /*!< [0x44] Timer PWM Counter Clock Pre-scale Register */
    __IO uint32_t PWMCNTCLR;  /*!< [0x48] Timer PWM Clear Counter Register */
    __IO uint32_t PWMPERIOD;  /*!< [0x4C] Timer PWM Period Register */
    __IO uint32_t PWMCMPDAT;  /*!< [0x50] Timer PWM Comparator Register */
    __I uint32_t PWMCNT;      /*!< [0x54] Timer PWM Counter Register */
    __IO uint32_t PWMPOLCTL;  /*!< [0x58] Timer PWM Pin Output Polar Control Register */
    __IO uint32_t PWMPOCTL;   /*!< [0x5C] Timer PWM Pin Output Control Register */
    __IO uint32_t PWMINTEN0;  /*!< [0x60] Timer PWM Interrupt Enable Register 0 */
    __IO uint32_t PWMINTSTS0; /*!< [0x64] Timer PWM Interrupt Status Register 0 */
    __IO uint32_t PWMTRGCTL;  /*!< [0x68] Timer PWM Trigger Control Register */
    __IO uint32_t PWMSTATUS;  /*!< [0x6C] Timer PWM Status Register */
    __I uint32_t PWMPBUF;     /*!< [0x70] Timer PWM Period Buffer Register */
    __I uint32_t PWMCMPBUF;   /*!< [0x74] Timer PWM Comparator Buffer Register */
    __I uint32_t RESERVE2[12];
    __IO uint32_t PWMIFA;      /*!< [0xA8] Timer PWM Interrupt Flag Accumulator Register          */
    __IO uint32_t PWMAINTSTS;  /*!< [0xAC] Timer PWM Accumulator Interrupt Flag Register          */
    __IO uint32_t PWMAINTEN;   /*!< [0xB0] Timer PWM Accumulator Interrupt Enable Register        */
    __IO uint32_t PWMAPDMACTL; /*!< [0xB4] Timer PWM Accumulator LPPDMA Control Register          */

