yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/timer_reg.h
#define TIMER_PWMINTSTS0_CMPUIF_Pos      (2)                                               /*!< TMR45_T::PWMINTSTS0: CMPUIF Position   */
#define TIMER_PWMINTSTS0_CMPUIF_Msk      (0x1ul << TIMER_PWMINTSTS0_CMPUIF_Pos)            /*!< TMR45_T::PWMINTSTS0: CMPUIF Mask       */

#define TIMER_PWMTRGCTL_TRGSEL_Pos       (0)                                               /*!< TMR45_T::PWMTRGCTL: TRGSEL Position    */
#define TIMER_PWMTRGCTL_TRGSEL_Msk       (0x3ul << TIMER_PWMTRGCTL_TRGSEL_Pos)             /*!< TMR45_T::PWMTRGCTL: TRGSEL Mask        */

#define TIMER_PWMTRGCTL_PWMTRGADC_Pos    (7)                                               /*!< TMR45_T::PWMTRGCTL: PWMTRGADC Position */
#define TIMER_PWMTRGCTL_PWMTRGADC_Msk    (0x1ul << TIMER_PWMTRGCTL_PWMTRGADC_Pos)          /*!< TMR45_T::PWMTRGCTL: PWMTRGADC Mask     */

#define TIMER_PWMTRGCTL_PWMTRGPDMA_Pos   (9)                                               /*!< TMR45_T::PWMTRGCTL: PWMTRGPDMA Position*/
#define TIMER_PWMTRGCTL_PWMTRGPDMA_Msk   (0x1ul << TIMER_PWMTRGCTL_PWMTRGPDMA_Pos)         /*!< TMR45_T::PWMTRGCTL: PWMTRGPDMA Mask    */

#define TIMER_PWMSTATUS_CNTMAXF_Pos      (0)                                               /*!< TMR45_T::PWMSTATUS: CNTMAXF Position   */
#define TIMER_PWMSTATUS_CNTMAXF_Msk      (0x1ul << TIMER_PWMSTATUS_CNTMAXF_Pos)            /*!< TMR45_T::PWMSTATUS: CNTMAXF Mask       */

#define TIMER_PWMSTATUS_ADCTRGF_Pos      (16)                                              /*!< TMR45_T::PWMSTATUS: ADCTRGF Position   */
#define TIMER_PWMSTATUS_ADCTRGF_Msk      (0x1ul << TIMER_PWMSTATUS_ADCTRGF_Pos)            /*!< TMR45_T::PWMSTATUS: ADCTRGF Mask       */

#define TIMER_PWMSTATUS_PDMATRGF_Pos     (18)                                              /*!< TMR45_T::PWMSTATUS: PDMATRGF Position  */
#define TIMER_PWMSTATUS_PDMATRGF_Msk     (0x1ul << TIMER_PWMSTATUS_PDMATRGF_Pos)           /*!< TMR45_T::PWMSTATUS: PDMATRGF Mask      */

#define TIMER_PWMPBUF_PBUF_Pos           (0)                                               /*!< TMR45_T::PWMPBUF: PBUF Position        */
#define TIMER_PWMPBUF_PBUF_Msk           (0xfffful << TIMER_PWMPBUF_PBUF_Pos)              /*!< TMR45_T::PWMPBUF: PBUF Mask            */

#define TIMER_PWMCMPBUF_CMPBUF_Pos       (0)                                               /*!< TMR45_T::PWMCMPBUF: CMPBUF Position    */
#define TIMER_PWMCMPBUF_CMPBUF_Msk       (0xfffful << TIMER_PWMCMPBUF_CMPBUF_Pos)          /*!< TMR45_T::PWMCMPBUF: CMPBUF Mask        */

#define TIMER_PWMIFA_IFACNT_Pos          (0)                                               /*!< TMR45_T::PWMIFA: IFACNT Position       */
#define TIMER_PWMIFA_IFACNT_Msk          (0xfffful << TIMER_PWMIFA_IFACNT_Pos)             /*!< TMR45_T::PWMIFA: IFACNT Mask           */

#define TIMER_PWMIFA_STPMOD_Pos          (24)                                              /*!< TMR45_T::PWMIFA: STPMOD Position       */
#define TIMER_PWMIFA_STPMOD_Msk          (0x1ul << TIMER_PWMIFA_STPMOD_Pos)                /*!< TMR45_T::PWMIFA: STPMOD Mask           */

#define TIMER_PWMIFA_IFASEL_Pos          (28)                                              /*!< TMR45_T::PWMIFA: IFASEL Position       */
#define TIMER_PWMIFA_IFASEL_Msk          (0x3ul << TIMER_PWMIFA_IFASEL_Pos)                /*!< TMR45_T::PWMIFA: IFASEL Mask           */

#define TIMER_PWMIFA_IFAEN_Pos           (31)                                              /*!< TMR45_T::PWMIFA: IFAEN Position        */
#define TIMER_PWMIFA_IFAEN_Msk           (0x1ul << TIMER_PWMIFA_IFAEN_Pos)                 /*!< TMR45_T::PWMIFA: IFAEN Mask            */

#define TIMER_PWMAINTSTS_IFAIF_Pos       (0)                                               /*!< TMR45_T::PWMAINTSTS: IFAIF Position    */
#define TIMER_PWMAINTSTS_IFAIF_Msk       (0x1ul << TIMER_PWMAINTSTS_IFAIF_Pos)             /*!< TMR45_T::PWMAINTSTS: IFAIF Mask        */

#define TIMER_PWMAINTEN_IFAIEN_Pos       (0)                                               /*!< TMR45_T::PWMAINTEN: IFAIEN Position    */
#define TIMER_PWMAINTEN_IFAIEN_Msk       (0x1ul << TIMER_PWMAINTEN_IFAIEN_Pos)             /*!< TMR45_T::PWMAINTEN: IFAIEN Mask        */

#define TIMER_PWMAPDMACTL_APDMAEN_Pos    (0)                                               /*!< TMR45_T::PWMAPDMACTL: APDMAEN Position */
#define TIMER_PWMAPDMACTL_APDMAEN_Msk    (0x1ul << TIMER_PWMAPDMACTL_APDMAEN_Pos)          /*!< TMR45_T::PWMAPDMACTL: APDMAEN Mask     */

/**@}*/ /* TIMER_CONST */
/**@}*/ /* end of TIMER register group */
/**@}*/ /* end of REGISTER group */

#if defined(__CC_ARM)
#pragma no_anon_unions
#endif

#endif /* __TIMER_REG_H__ */
